In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([1,-4, 5, 10, 11])

In [3]:
obj

0     1
1    -4
2     5
3    10
4    11
dtype: int64

In [4]:
obj.values

array([ 1, -4,  5, 10, 11], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
obj2 = pd.Series([1,-4, 5, 10, 11],index=['a','b','c','d','e'])

In [7]:
obj2

a     1
b    -4
c     5
d    10
e    11
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [9]:
obj2['a']

1

In [10]:
obj2['d']=20

In [11]:
obj2

a     1
b    -4
c     5
d    20
e    11
dtype: int64

In [12]:
obj2[obj2>5]

d    20
e    11
dtype: int64

In [13]:
obj2*2

a     2
b    -8
c    10
d    40
e    22
dtype: int64

In [14]:
'f' in obj2

False

In [15]:
'a' in obj2

True

In [16]:
sddata = {'Ohio':3500,'Illinois':2000,'Texas':1000,'DC':5000}

In [17]:
obj3 = pd.Series(sddata)

In [18]:
obj3

Ohio        3500
Illinois    2000
Texas       1000
DC          5000
dtype: int64

In [19]:
obj3.index

Index(['Ohio', 'Illinois', 'Texas', 'DC'], dtype='object')

In [20]:
states = ['California','Ohio','Illinois','DC']
obj4 = pd.Series(sddata, index=states)

In [21]:
obj4

California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
dtype: float64

In [22]:
obj4.isna

<bound method Series.isna of California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
dtype: float64>

In [23]:
obj4.isnull

<bound method Series.isnull of California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
dtype: float64>

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Illinois      False
DC            False
dtype: bool

In [27]:
pd.isna(obj4)

California     True
Ohio          False
Illinois      False
DC            False
dtype: bool

In [28]:
obj3+obj4

California        NaN
DC            10000.0
Illinois       4000.0
Ohio           7000.0
Texas             NaN
dtype: float64

In [25]:
obj4.name = 'Crime Count'

In [26]:
obj4.index.name = 'State'

In [27]:
obj4

State
California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
Name: Crime Count, dtype: float64

In [28]:
obj4.index = ['DC','Ohio','Illinois','California']

In [29]:
obj4

DC               NaN
Ohio          3500.0
Illinois      2000.0
California    5000.0
Name: Crime Count, dtype: float64

In [30]:
data = {'State':['Illinois','Ohio','DC','Iowa','Indiana'],
         'Population':[100000,20000,10000,5000,20000],
       'Year':[2001,2005,2010,2008,2005]}

In [31]:
dobj = pd.DataFrame(data)

In [32]:
dobj

      State  Population  Year
0  Illinois      100000  2001
1      Ohio       20000  2005
2        DC       10000  2010
3      Iowa        5000  2008
4   Indiana       20000  2005

In [33]:
dobj.head()

      State  Population  Year
0  Illinois      100000  2001
1      Ohio       20000  2005
2        DC       10000  2010
3      Iowa        5000  2008
4   Indiana       20000  2005

In [34]:
dobj.tail()

      State  Population  Year
0  Illinois      100000  2001
1      Ohio       20000  2005
2        DC       10000  2010
3      Iowa        5000  2008
4   Indiana       20000  2005

In [37]:
dobj2 = pd.DataFrame(data, columns = ['Year','State','Population','Debt'],
                    index = ['One','Two','Three','Four','Five'])

In [38]:
obj2

a     1
b    -4
c     5
d    20
e    11
dtype: int64

In [39]:
dobj2

       Year     State  Population Debt
One    2001  Illinois      100000  NaN
Two    2005      Ohio       20000  NaN
Three  2010        DC       10000  NaN
Four   2008      Iowa        5000  NaN
Five   2005   Indiana       20000  NaN

In [40]:
obj2.Debt = 15.5

In [41]:
obj2

a     1
b    -4
c     5
d    20
e    11
dtype: int64

In [42]:
dobj2.Debt = 15.5

In [43]:
dobj2

       Year     State  Population  Debt
One    2001  Illinois      100000  15.5
Two    2005      Ohio       20000  15.5
Three  2010        DC       10000  15.5
Four   2008      Iowa        5000  15.5
Five   2005   Indiana       20000  15.5

In [49]:
dobj2.Debt = np.arange(5)

In [50]:
dobj2.Debt = np.arange(5)

In [51]:
dobj2

       Year     State  Population  Debt
One    2001  Illinois      100000     0
Two    2005      Ohio       20000     1
Three  2010        DC       10000     2
Four   2008      Iowa        5000     3
Five   2005   Indiana       20000     4

In [60]:
dobj2.loc['One']

Year              2001
State         Illinois
Population      100000
Debt                 0
Name: One, dtype: object

In [66]:
newstate = pd.Series(data = ['Ohio','Ohio','Iowa','Iowa','Iowa'],index = ['One','Two','Three','Four','Five'] )

In [67]:
dobj2.State = newstate

In [68]:
dobj2

       Year State  Population  Debt
One    2001  Ohio      100000     0
Two    2005  Ohio       20000     1
Three  2010  Iowa       10000     2
Four   2008  Iowa        5000     3
Five   2005  Iowa       20000     4

In [66]:
dobj2.Debt = np.random.randn(5)

In [68]:
dobj2

       Year State  Population      Debt
One    2001  Ohio      100000  0.979862
Two    2005  Ohio       20000  0.823669
Three  2010  Iowa       10000  0.459493
Four   2008  Iowa        5000 -1.272409
Five   2005  Iowa       20000 -0.099431

In [69]:
dobj2['Estern']=dobj2.State == 'Ohio'

In [70]:
dobj2[dobj2.State=='Iowa']

       Year State  Population  Debt  Estern
Three  2010  Iowa       10000     2   False
Four   2008  Iowa        5000     3   False
Five   2005  Iowa       20000     4   False

In [76]:
dobj2
dobj2[dobj2.Population >=10000][dobj2.State == 'Ohio']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

     Year State  Population  Debt  Estern
One  2001  Ohio      100000     0    True
Two  2005  Ohio       20000     1    True

In [78]:
dfnew = pd.DataFrame(data=np.arange(16).reshape(4,4),index=['Illinois','Ohio','DC','New York'],columns=[2001,2002,2003,2005])

In [80]:
dfnew

          2001  2002  2003  2005
Illinois     0     1     2     3
Ohio         4     5     6     7
DC           8     9    10    11
New York    12    13    14    15

In [82]:
dfnew.drop('New York')

          2001  2002  2003  2005
Illinois     0     1     2     3
Ohio         4     5     6     7
DC           8     9    10    11

In [83]:
data

{'State': ['Illinois', 'Ohio', 'DC', 'Iowa', 'Indiana'],
 'Population': [100000, 20000, 10000, 5000, 20000],
 'Year': [2001, 2005, 2010, 2008, 2005]}

In [84]:
dfnew

          2001  2002  2003  2005
Illinois     0     1     2     3
Ohio         4     5     6     7
DC           8     9    10    11
New York    12    13    14    15

In [85]:
datas = pd.Series(np.arange(4.),index=['a','b','c','d'])

In [86]:
datas

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [88]:
datas[1:]

b    1.0
c    2.0
d    3.0
dtype: float64

In [89]:
datas[1:3]

b    1.0
c    2.0
dtype: float64

In [90]:
datas['a':'d']

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [92]:
dfnew

          2001  2002  2003  2005
Illinois     0     1     2     3
Ohio         4     5     6     7
DC           8     9    10    11
New York    12    13    14    15

In [93]:
dfnew[2001]

Illinois     0
Ohio         4
DC           8
New York    12
Name: 2001, dtype: int32

In [95]:
dfnew[[2001,2005]]

          2001  2005
Illinois     0     3
Ohio         4     7
DC           8    11
New York    12    15

In [97]:
dfnew[:2]

          2001  2002  2003  2005
Illinois     0     1     2     3
Ohio         4     5     6     7

In [101]:
dfnew['Illinois':'DC'][[2001,2005]]

          2001  2005
Illinois     0     3
Ohio         4     7
DC           8    11

In [103]:
dfnew[dfnew[2005]>=7]

          2001  2002  2003  2005
Ohio         4     5     6     7
DC           8     9    10    11
New York    12    13    14    15

In [104]:
dfnew[dfnew[2005]>=7]['Ohio':'DC']

      2001  2002  2003  2005
Ohio     4     5     6     7
DC       8     9    10    11

In [106]:
dfnew

          2001  2002  2003  2005
Illinois     0     1     2     3
Ohio         4     5     6     7
DC           8     9    10    11
New York    12    13    14    15

In [113]:
dfnew.iloc[2]

2001     8
2002     9
2003    10
2005    11
Name: DC, dtype: int32

In [114]:
dfnew.loc['Illinois',[2001,2005]]

2001    0
2005    3
Name: Illinois, dtype: int32

In [115]:
dfnew.loc[['Illinois','DC'],[2001,2003]]

          2001  2003
Illinois     0     2
DC           8    10

In [117]:
dfnew.iloc[:,:3]

          2001  2002  2003
Illinois     0     1     2
Ohio         4     5     6
DC           8     9    10
New York    12    13    14

In [120]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [122]:
ser[-1]

KeyError: -1

In [123]:
ser2 = pd.Series(np.arange(3.),index=['a','b','c'])

In [124]:
ser2[-1]

2.0

In [4]:
frame = pd.DataFrame(np.random.randn(2,3),index=[1,2],columns=['a','b','c'])

In [5]:
frame

          a         b         c
1  1.764774  0.405764 -0.610351
2 -0.431052  0.519579  0.547326

In [6]:
np.abs(frame)

          a         b         c
1  1.764774  0.405764  0.610351
2  0.431052  0.519579  0.547326

In [7]:
f = lambda x: x.max() - x.min()

In [8]:
frame.apply(f)

a    2.195826
b    0.113815
c    1.157677
dtype: float64

In [9]:
frame.apply(f,axis=1)

1    2.375124
2    0.978379
dtype: float64

In [11]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [12]:
frame.apply(f)

            a         b         c
min -0.431052  0.405764 -0.610351
max  1.764774  0.519579  0.547326